
## 🏗️ Terraform Plan Results

<details>
<summary>📋 Click to expand plan</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_cloud_run_v2_service.bridge_ui has been deleted
  - resource "google_cloud_run_v2_service" "bridge_ui" {
        id                      = "projects/death-star-platform-666/locations/us-central1/services/bridge-ui"
      - location                = "us-central1" -> null
      - name                    = "bridge-ui" -> null
      - project                 = "death-star-platform-666" -> null
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_v2_service.command_core has been deleted
  - resource "google_cloud_run_v2_service" "command_core" {
        id                      = "projects/death-star-platform-666/locations/us-central1/services/command-core"
      - location                = "us-central1" -> null
      - name                    = "command-core" -> null
      - project                 = "death-star-platform-666" -> null
      - uri                     = "https://command-core-tvhxrvndna-uc.a.run.app" -> null
        # (30 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_v2_service.bridge_ui will be created
  + resource "google_cloud_run_v2_service" "bridge_ui" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "bridge-ui"
      + observed_generation     = (known after apply)
      + project                 = "death-star-platform-666"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-central1-docker.pkg.dev/death-star-platform-666/death-star-images/death-star-bridge-ui:a2bb15846d5cb5ffffaef78f894b36fca7e3f06b"

              + env {
                  + name  = "NEXT_PUBLIC_BFF_URL"
                  + value = (known after apply)
                }

              + ports {
                  + container_port = 3000
                  + name           = (known after apply)
                }

              + resources (known after apply)

              + startup_probe (known after apply)
            }

          + scaling {
              + max_instance_count = 10
              + min_instance_count = 0
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # google_cloud_run_v2_service.command_core will be created
  + resource "google_cloud_run_v2_service" "command_core" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "command-core"
      + observed_generation     = (known after apply)
      + project                 = "death-star-platform-666"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-central1-docker.pkg.dev/death-star-platform-666/death-star-images/death-star-command-core:126614853aed4518ff75ee3c1849accc502b46ad"

              + env {
                  + name  = "FF_HEALTH_ENDPOINT"
                  + value = "true"
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources (known after apply)

              + startup_probe (known after apply)
            }

          + scaling {
              + max_instance_count = 10
              + min_instance_count = 0
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # google_cloud_run_v2_service_iam_binding.bridge_ui_public_access will be updated in-place
  ~ resource "google_cloud_run_v2_service_iam_binding" "bridge_ui_public_access" {
        id       = "projects/death-star-platform-666/locations/us-central1/services/bridge-ui/roles/run.invoker"
      ~ members  = [
          + "allUsers",
        ]
        name     = "projects/death-star-platform-666/locations/us-central1/services/bridge-ui"
        # (4 unchanged attributes hidden)
    }

  # google_cloud_run_v2_service_iam_binding.command_core_public_access will be updated in-place
  ~ resource "google_cloud_run_v2_service_iam_binding" "command_core_public_access" {
        id       = "projects/death-star-platform-666/locations/us-central1/services/command-core/roles/run.invoker"
      ~ members  = [
          + "allUsers",
        ]
        name     = "projects/death-star-platform-666/locations/us-central1/services/command-core"
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>

**Triggered by**: simaopgt
**Commit**: 863be6bed4b10969578b54df1e56cecaffbdcebb
